app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rubens"], ["last_name", "Fernandes"], ["created_at", "2020-06-11 02:11:28.904037"], ["updated_at", "2020-06-11 02:11:28.904037"]]
---
  def create
    @student = Student.new(student_params)
      if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "HELLO"], ["updated_at", "2020-06-11 02:15:44.251773"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)